---
kind: other
id: Properties.T:Autodesk.Revit.DB.ElementIntersectsSolidFilter
source: html/978cd3c8-d946-3c61-a61f-9be2958ce7ad.htm
---
# ElementIntersectsSolidFilter Properties

True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected,
 and elements that would normally be rejected will be accepted.